app/views/projects/show.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ?  [["project_id", 2]]
SELECT 1 AS one FROM "tasks" WHERE "tasks"."project_id" = ? LIMIT ?  [["project_id", 2], ["LIMIT", 1]]
---
  <br></br>
      <% if @project.tasks.any? %>
        <h2>Tasks:</h2>
        <% @project.tasks.each do |task| %>