app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "description", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "one"], ["description", "first project"], ["status", "open"], ["created_at", "2023-11-29 17:25:03.347721"], ["updated_at", "2023-11-29 17:25:03.347721"]]
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save