app/controllers/projects_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ?  [["project_id", 2]]
---
  def show
    @tasks = current_user.projects.find_by(params[:id]).tasks