app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("name", "decription", "due_date", "due_time", "created_at", "updated_at", "project_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "new Task"], ["decription", ""], ["due_date", ""], ["due_time", ""], ["created_at", "2023-12-01 17:13:06.510936"], ["updated_at", "2023-12-01 17:13:06.510936"], ["project_id", 2]]
---
  def create
    @task = @project.tasks.build(task_params)

    respond_to do |format|
      if @task.save